HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_defines.h
#ifndef P32MZ2048EFG100DEFINES_INC
#define P32MZ2048EFG100DEFINES_INC 100
#
#define PORT_A
#define PORT_A0
#define PORT_A1
#define PORT_A2
#define PORT_A3
#define PORT_A4
#define PORT_A5
#define PORT_A6
#define PORT_A7
#define PORT_A9
#define PORT_A10
#define PORT_A14
#define PORT_A15
#define PORT_B
#define PORT_B0
#define PORT_B1
#define PORT_B2
#define PORT_B3
#define PORT_B4
#define PORT_B5
#define PORT_B6
#define PORT_B7
#define PORT_B8
#define PORT_B9
#define PORT_B10
#define PORT_B11
#define PORT_B12
#define PORT_B13
#define PORT_B14
#define PORT_B15
#define PORT_C
#define PORT_C1
#define PORT_C2
#define PORT_C3
#define PORT_C4
#define PORT_C12
#define PORT_C13
#define PORT_C14
#define PORT_C15
#define PORT_D
#define PORT_D0
#define PORT_D1
#define PORT_D2
#define PORT_D3
#define PORT_D4
#define PORT_D5
#define PORT_D9
#define PORT_D10
#define PORT_D11
#define PORT_D12
#define PORT_D13
#define PORT_D14
#define PORT_D15
#define PORT_E
#define PORT_E0
#define PORT_E1
#define PORT_E2
#define PORT_E3
#define PORT_E4
#define PORT_E5
#define PORT_E6
#define PORT_E7
#define PORT_E8
#define PORT_E9
#define PORT_F
#define PORT_F0
#define PORT_F1
#define PORT_F2
#define PORT_F3
#define PORT_F4
#define PORT_F5
#define PORT_F8
#define PORT_F12
#define PORT_F13
#define PORT_G
#define PORT_G0
#define PORT_G1
#define PORT_G6
#define PORT_G7
#define PORT_G8
#define PORT_G9
#define PORT_G12
#define PORT_G13
#define PORT_G14
#define PORT_G15

#define PORT_ANALOG_B0	0
#define PORT_ANALOG_B1	1
#define PORT_ANALOG_B2 2
#define PORT_ANALOG_B3 3
#define PORT_ANALOG_B4 4
#define PORT_ANALOG_B10 5
#define PORT_ANALOG_B11 6
#define PORT_ANALOG_B12 7
#define PORT_ANALOG_B13 8
#define PORT_ANALOG_B14 9
#define PORT_ANALOG_B15 10
#define PORT_ANALOG_G9 11
#define PORT_ANALOG_G8 12
#define PORT_ANALOG_G7 13
#define PORT_ANALOG_G6 14
#define PORT_ANALOG_E7 15
#define PORT_ANALOG_E6 16
#define PORT_ANALOG_E5 17
#define PORT_ANALOG_E4 18
#define PORT_ANALOG_C4 19
#define PORT_ANALOG_C3 20
#define PORT_ANALOG_C2 21
#define PORT_ANALOG_C1 22
#define PORT_ANALOG_G15 23
#define PORT_ANALOG_A0 24
#define PORT_ANALOG_E8 25
#define PORT_ANALOG_E9 26
#define PORT_ANALOG_A9 27
#define PORT_ANALOG_A10 28
#define PORT_ANALOG_A1 29
#define PORT_ANALOG_F13 30
#define PORT_ANALOG_F12 31
#define PORT_ANALOG_D14 32
#define PORT_ANALOG_D15 33
#define PORT_ANALOG_A5 34

#define PORT_ANALOG_B5 45
#define PORT_ANALOG_B6 46
#define PORT_ANALOG_B7 47
#define PORT_ANALOG_B8 48
#define PORT_ANALOG_B9 49

#define ADC_ANALOG_0	0
#define ADC_ANALOG_1	1
#define ADC_ANALOG_2	2
#define ADC_ANALOG_3	3
#define ADC_ANALOG_4	4
#define ADC_ANALOG_5	7
#define ADC_ANALOG_6	7
#define ADC_ANALOG_7	7
#define ADC_ANALOG_8	7
#define ADC_ANALOG_9	7
#define ADC_ANALOG_10	7
#define ADC_ANALOG_11	7
#define ADC_ANALOG_12	7
#define ADC_ANALOG_13	7
#define ADC_ANALOG_14	7
#define ADC_ANALOG_15	7
#define ADC_ANALOG_16	7
#define ADC_ANALOG_17	7
#define ADC_ANALOG_18	7
#define ADC_ANALOG_19	7
#define ADC_ANALOG_20	7
#define ADC_ANALOG_21	7
#define ADC_ANALOG_22	7
#define ADC_ANALOG_23	7
#define ADC_ANALOG_24	7
#define ADC_ANALOG_25	7
#define ADC_ANALOG_26	7
#define ADC_ANALOG_27	7
#define ADC_ANALOG_28	7
#define ADC_ANALOG_29	7
#define ADC_ANALOG_30	7
#define ADC_ANALOG_31	7
#define ADC_ANALOG_32	7
#define ADC_ANALOG_33	7
#define ADC_ANALOG_34	7
#define ADC_ANALOG_45	0
#define ADC_ANALOG_46	1
#define ADC_ANALOG_47	2
#define ADC_ANALOG_48	3
#define ADC_ANALOG_49	4


#
#endif
